pablomdd/PIC16f887-EEPROM-I2C/eeprom_i2c.c
/*
 *	I2C External EEPROM example using SimpleC
 *	This code will write 10 bytes to the EEPROM and 
 *	then read them back and display binary value on LEDs.
 * Connections:
 * Pin 8(B0) - LED Anode - LED Cathode - 470ohm - Ground
 * Pin 9(B1) - LED Anode - LED Cathode - 470ohm - Ground
 * Pin 10(B2) - LED Anode - LED Cathode - 470ohm - Ground
 * Pin 11(B3) - LED Anode - LED Cathode - 470ohm - Ground
 *
 * Pin 3(C4) - 24LC02B SDA - 10k pullup - 5v
 * Pin 4(C3) - 24LC02B SCL - 10k pullup - 5v
 * 24LC02B Vss - Ground
 * 24LC02B Vdd - 5v
 */

#include <htc.h>
#include <stdio.h>
#include <pic16f887.h>
//#include <24512.h>
#include <stdio.h>
#include <ctype.h>

__CONFIG (FOSC_INTRC_NOCLKOUT & WDTE_OFF & PWRTE_OFF & MCLRE_OFF & CP_OFF & CPD_OFF & BOREN_OFF & IESO_OFF & FCMEN_OFF & LVP_OFF & DEBUG_OFF);
__CONFIG (BOR4V_BOR40V & WRT_OFF); //Internal clock, Watchdog off, MCLR off, Code Unprotected

#include "simplec1.1.h"

//________________________config Puerto Serial

#define RX_PIN TRISC7
#define TX_PIN TRISC6

void gets_Serial(char *); 

unsigned char *pa=&PORTA; 
char in[17];
int  convint;  
int dir; 
int  atoi( const char * s );


//LCD CONFIG

#define LCD_RS RA7
#define LCD_RW RE1
#define LCD_EN RA6

#define LCD_DATA PORTD
#define LCD_STROBE()  ((LCD_EN=1),(LCD_EN=0))
char init_value=0x03;


//ADC PREP

unsigned short b0=0;
int nin=0x00;

unsigned char carac[5];
unsigned char carac2[3];

float	num=0;
float	num1=0.00488758553;
float   num3=0;
//LCD FUNCTIONS
/*
void lcd_write(unsigned char c)
{
	pause(1);
	LCD_DATA=((c >> 4) & 0x0F);
	LCD_STROBE();
	LCD_DATA=(c & 0x0F);
	LCD_STROBE();
}

void lcd_clear(void)
{
	LCD_RS=0;
	lcd_write(0x1);
	pause(2);
}

void lcd_puts(const char * s)
{
	LCD_RS=1;
	while(*s)
		lcd_write(*s++);
}

void lcd_putch(char c)
{
	LCD_RS=1;
	lcd_write(c);
}

void lcd_goto(unsigned char pos)
{
	LCD_RS=0;
	lcd_write(0x80+pos);
}

*/


// ___________________________________ Library Functions _______________________________________

//*******************************************************
// Initialize Microcontroller Setup
//*******************************************************

void init_micro(void)
{
	ANSEL = 0; 		//Analog ports set to digital		
	ANSELH = 0;
	CM1CON0 = 0;	//Comparators Shut off
	CM2CON0 = 0;
//	IRCF0 = 0;		// Set internal Oscillator to 4 Mhz
//	IRCF1 = 1;
//	IRCF2 = 1;
//	SCS = 1;		// Config bits define clock
	INTCON=0;	// purpose of disabling the interrupts
}

/********************************************************
* usecbase - 10 usec pause routine						*
* The Internal oscillator is set to 16 Mhz and the		*
* internal instruction clock is 1/4 of the oscillator.	*
* This makes the internal instruction clock 4 Mhz or	*
* 0.25 usec per clock pulse.							*
* Using the 1:1 prescaler on the clock input to Timer0	* 
* slows the Timer0 count increment to 1 count/.25 usec.	*
* Therefore 40 counts of the Timer0 would make a ten	*
* usec delay (25 * .25 usec). But there are other		*
* instructions in the delay loop so using the MPLAB 	*
* stopwatch we find that we need Timer0 to overflow at 	*
* 9 clock ticks. Preset Timer0 to 247 (F7 hex) to make	*
* Timer0 overflow at 9 clock ticks (256-9 = 247).		*
* This results in a 10.0 microsecond delay. 			*
*********************************************************/

void usecbase(void)
{
	OPTION_REG = 0b00001000;		//Set prescaler to TMRO 1:1
	TMR0 = 0xF7;				//Preset TMRO to overflow on 250 counts
	while(!T0IF);				//Stay until TMRO overflow flag equals 1
	T0IF = 0;					//Clear the TMR0 overflow flag
}

//**********************************************************
//pauseus - millisecond delay routine 1 to 65,535 in 100usec steps
//**********************************************************


void pauseus ( unsigned int usvalue )

{
	unsigned int x;
	
	for (x=0; x<=usvalue; x++)	//Loop through a delay equal to usvalue
		{						// in milliseconds.
		usecbase();				//Jump to millisec delay routine
		}
}

/********************************************************
* msecbase - 1 msec pause routine						
* The External oscillator is set to 16 Mhz and the		
* internal instruction clock is 1/4 of the oscillator.	
* This makes the internal instruction clock 4 Mhz or	
* 0.25 usec per clock pulse.							
* Using the 1:16 prescaler on the clock input to Timer0	 
* slows the Timer0 count increment to 1 count/4 usec.	
* Therefore 250 counts of the Timer0 would make a one	
* millisecond delay (250 * 4 usec). But there are other	
* instructions in the delay loop so using the MPLAB 	
* stopwatch we find that we need Timer0 to overflow at 	
* 243 clock ticks. Preset Timer0 to 13 (0D hex) to make	
* Timer0 overflow at 243 clock ticks (256-13 = 243).	
*********************************************************/

void msecbase(void)
{
	OPTION_REG = 0b00000011;	//Set prescaler to TMRO 1:16
	TMR0 = 0xD;			//Preset TMRO to overflow on 243 counts
	while(!T0IF);		//Stay until TMRO overflow flag equals 1
	T0IF = 0;			//Clear the TMR0 overflow flag
}



//**********************************************************
//pause - millisecond delay routine 1 to 65,535 milliseconds
//**********************************************************


void pause( unsigned long usvalue )

{
	unsigned long x;		
	for (x=1; x<=(usvalue); x++)	//Loop through a delay equal to usvalue
		{						// in milliseconds.
		msecbase();				//Jump to millisec delay routine
		}
}

// ****************************************************
// High Command to set a port high
// ****************************************************

void high(char pin)
{
switch(pin)
	{
	case 0:
	TRISC7 = 0;				// Make RC7 an Output
	RC7 = 1;				// Set RC7 High
	break;
	
	case 1:
	TRISC6 = 0;				// Make RC6 an Output
	RC6 = 1;				// Set RC6 High
	break;

	case 2:
	TRISC5 = 0;				// Make RC5 an Output
	RC5 = 1;				// Set RC5 High
	break;

	case 3:
	TRISC4 = 0;				// Make RC4 an Output
	RC4 = 1;				// Set RC4 High
	break;

	case 4:
	TRISC3 = 0;				// Make RC3 an Output
	RC3 = 1;				// Set RC3 High
	break;

	case 5:
	TRISC2 = 0;				// Make RC2 an Output
	RC2 = 1;				// Set RC2 High
	break;
	
