pablomdd/PIC16f887-EEPROM-I2C/eeprom_i2c.c
	case 6:
	TRISC1 = 0;				// Make RC1 an Output
	RC1 = 1;				// Set RC1 High
	break;

	case 7:
	TRISC0 = 0;				// Make RC0 an Output
	RC0 = 1;				// Set RC0 High
	break;

	case 8:
	TRISB0 = 0;				// Make RB0 an Output
	RB0 = 1;				// Set RB0 High
	break;

	case 9:
	TRISB1 = 0;				// Make RB1 an Output
	RB1 = 1;				// Set RB1 High
	break;

	case 10:
	TRISB2 = 0;				// Make RB2 an Output
	RB2 = 1;				// Set RB2 High
	break;
	
	case 11:
	TRISB3 = 0;				// Make RB3 an Output
	RB3 = 1;				// Set RB3 High
	break;

	case 12:
	TRISB4 = 0;				// Make RB4 an Output
	RB4 = 1;				// Set RB4 High
	break;

	case 13:
	TRISB5 = 0;				// Make RB5 an Output
	RB5 = 1;				// Set RB5 High
	break;

	
	default:
	break;
	}
}

// ****************************************************
// Low Command to set a port low
// ****************************************************

void low(char pin)
{
switch(pin)
	{
	case 0:
	TRISC7 = 0;				// Make RC7 an Output
	RC7 = 0;				// Set RC7 low
	break;
	
	case 1:
	TRISC6 = 0;				// Make RC6 an Output
	RC6 = 0;				// Set RC6 low
	break;

	case 2:
	TRISC5 = 0;				// Make RC5 an Output
	RC5 = 0;				// Set RC5 low
	break;

	case 3:
	TRISC4 = 0;				// Make RC4 an Output
	RC4 = 0;				// Set RC4 low
	break;

	case 4:
	TRISC3 = 0;				// Make RC3 an Output
	RC3 = 0;				// Set RC3 low
	break;

	case 5:
	TRISC2 = 0;				// Make RC2 an Output
	RC2 = 0;				// Set RC2 low
	break;
	
	case 6:
	TRISC1 = 0;				// Make RC1 an Output
	RC1 = 0;				// Set RC1 low
	break;

	case 7:
	TRISC0 = 0;				// Make RC0 an Output
	RC0 = 0;				// Set RC0 low
	break;

	case 8:
	TRISB0 = 0;				// Make RB0 an Output
	RB0 = 0;				// Set RB0 low
	break;

	case 9:
	TRISB1 = 0;				// Make RB1 an Output
	RB1 = 0;				// Set RB1 low
	break;

	case 10:
	TRISB2 = 0;				// Make RB2 an Output
	RB2 = 0;				// Set RB2 low
	break;
	
	case 11:
	TRISB3 = 0;				// Make RB3 an Output
	RB3 = 0;				// Set RB3 low
	break;

	case 12:
	TRISB4 = 0;				// Make RB4 an Output
	RB4 = 0;				// Set RB4 low
	break;

	case 13:
	TRISB5 = 0;				// Make RB5 an Output
	RB5 = 0;				// Set RB5 low
	break;

	
	default:
	break;
	}
}

// ****************************************************
// Input Command to read a digital port 
// ****************************************************

char input(char pin)
{
char val = 0;
switch(pin)
	{
	case 0:
	TRISC7 = 1;				// Make RC7 an input
	if (RC7 == 1)			// Test RC7 pin
	{val = 1;}
	else
	{val = 0;}				
	break;
	
	case 1:
	TRISC6 = 1;				// Make RC6 an input
	if (RC6 == 1)			// Test RC6 pin
	{val = 1;}
	else
	{val = 0;}	
	break;

	case 2:
	TRISC5 = 1;				// Make RC5 an input
	if (RC5 == 1)			// Test RC5 pin
	{val = 1;}
	else
	{val = 0;}	
	break;

	case 3:
	TRISC4 = 1;				// Make RC4 an input
	if (RC4 == 1)			// Test RC4 pin
	{val = 1;}
	else
	{val = 0;}	
	break;

	case 4:
	TRISC3 = 1;				// Make RC3 an input
	if (RC3 == 1)			// Test RC3 pin
	{val = 1;}
	else
	{val = 0;}	
	break;

	case 5:
	TRISC2 = 1;				// Make RC2 an input
	if (RC2 == 1)			// Test RC2 pin
	{val = 1;}
	else
	{val = 0;}	
	break;
	
	case 6:
	TRISC1 = 1;				// Make RC1 an input
	if (RC1 == 1)			// Test RC1 pin
	{val = 1;}
	else
	{val = 0;}	
	break;

	case 7:
	TRISC0 = 1;				// Make RC0 an input
	if (RC0 == 1)			// Test RC0 pin
	{val = 1;}
	else
	{val = 0;}	
	break;

	case 8:
	TRISB0 = 1;				// Make RB0 an input
	if (RB0 == 1)			// Test RB0 pin
	{val = 1;}
	else
	{val = 0;}	
	break;

	case 9:
	TRISB1 = 1;				// Make RB1 an input
	if (RB1 == 1)			// Test RB1 pin
	{val = 1;}
	else
	{val = 0;}	
	break;

	case 10:
	TRISB2 = 1;				// Make RB2 an input
	if (RB2 == 1)			// Test RB2 pin
	{val = 1;}
	else
	{val = 0;}	
	break;
	
	case 11:
	TRISB3 = 1;				// Make RB3 an input
	if (RB3 == 1)			// Test RB3 pin
	{val = 1;}
	else
	{val = 0;}	
	break;

	case 12:
	TRISB4 = 1;				// Make RB4 an input
	if (RB4 == 1)			// Test RB4 pin
	{val = 1;}
	else
	{val = 0;}	
	break;

	case 13:
	TRISB5 = 1;				// Make RB5 an input
	if (RB5 == 1)			// Test RB5 pin
	{val = 1;}
	else
	{val = 0;}	
	break;

	
	default:
	break;
	}

	return val;				// Return port pin state
}

// ****************************************************
// Pulseout Command to set a port high for period of time
// ****************************************************

void pulseout(char pin, unsigned long per)
{
switch(pin)
	{
	case 0:
	TRISC7 = 0;				// Make RC7 an Output
	RC7 = 1;				// Set RC7 High
	pauseus(per);
	RC7 = 0;				// Set RC7 Low
	break;
	
	case 1:
	TRISC6 = 0;				// Make RC6 an Output
	RC6 = 1;				// Set RC6 High
	pauseus(per);			// delay
	RC6 = 0;				// Set RC6 Low
	break;

	case 2:
	TRISC5 = 0;				// Make RC5 an Output
	RC5 = 1;				// Set RC5 High
	pauseus(per);			// delay
	RC5 = 0;				// Set RC5 Low
	break;

	case 3:
	TRISC4 = 0;				// Make RC4 an Output
	RC4 = 1;				// Set RC4 High
	pauseus(per);			// delay
	RC4 = 0;				// Set RC4 Low
	break;

	case 4:
	TRISC3 = 0;				// Make RC3 an Output
	RC3 = 1;				// Set RC3 High
	pauseus(per);			// delay
	RC3 = 0;				// Set RC3 Low
	break;

	case 5:
	TRISC2 = 0;				// Make RC2 an Output
	RC2 = 1;				// Set RC2 High
	pauseus(per);			// delay
	RC2 = 0;				// Set RC2 Low
	break;
	
	case 6:
	TRISC1 = 0;				// Make RC1 an Output
	RC1 = 1;				// Set RC1 High
	pauseus(per);			// delay
	RC1 = 0;				// Set RC1 Low
	break;

	case 7:
	TRISC0 = 0;				// Make RC0 an Output
	RC0 = 1;				// Set RC0 High
	pauseus(per);			// delay
	RC0 = 0;				// Set RC0 Low
	break;

	case 8:
	TRISB0 = 0;				// Make RB0 an Output
	RB0 = 1;				// Set RB0 High
	pauseus(per);			// delay
	RB0 = 0;				// Set RB0 Low
	break;

	case 9:
	TRISB1 = 0;				// Make RB1 an Output
	RB1 = 1;				// Set RB1 High
	pauseus(per);			// delay
	RB1 = 0;				// Set RB1 Low
	break;

	case 10:
	TRISB2 = 0;				// Make RB2 an Output
	RB2 = 1;				// Set RB2 High
	pauseus(per);			// delay
	RB2 = 0;				// Set RB2 Low
	break;
	
	case 11:
	TRISB3 = 0;				// Make RB3 an Output
	RB3 = 1;				// Set RB3 High
	pauseus(per);			// delay
	RB3 = 0;				// Set RB3 Low
	break;

	case 12:
	TRISB4 = 0;				// Make RB4 an Output
	RB4 = 1;				// Set RB4 High
	pauseus(per);			// delay
	RB4 = 0;				// Set RB4 Low
	break;

	case 13:
	TRISB5 = 0;				// Make RB5 an Output
	RB5 = 1;				// Set RB5 High
	pauseus(per);			// delay
	RB5 = 0;				// Set RB5 Low
	break;

	
	default:
	break;
	}
}


