pablomdd/PIC16f887-EEPROM-I2C/eeprom_i2c.c
// ****************************************************
// LCD internal write routine
// ****************************************************
 

void
lcd_write(unsigned char c)
{
//	pause (1);

char temp = ( ( ( c >> 4 ) & 0x0F );
	LCD_DATA = LCD_DATA & 0xF0;
	LCD_DATA = LCD_DATA + temp;
	LCD_STROBE();

	temp = ( c & 0x0F );
	LCD_DATA = LCD_DATA & 0xF0;
	LCD_DATA = LCD_DATA + temp;
	LCD_STROBE();
}

// ****************************************************
// Clear and home the LCD
// ****************************************************

void
lcd_clear(void)
{
	LCD_RS = 0;
	lcd_write(0x1);
//	pause (2);
}


// ****************************************************
// Write a string of ASCII text to the LCD
// ****************************************************
 
void
lcd_text(const char * s)
{
	LCD_RS = 1;	// write characters
	while(*s)
	lcd_write(*s++);
}


// ****************************************************
// Write a single ASCII character to the LCD
// ****************************************************


void
lcd_symbol(char c)
{
	LCD_RS = 1;	// write characters
	lcd_write( c );
}


// ****************************************************
// Go to specific position on the LCD
// ****************************************************

void
lcd_goto(unsigned char pos)
{
	LCD_RS = 0;
	lcd_write(0x80+pos);
}

// ****************************************************
// Display 3 digit number
// ****************************************************

void
lcd_number(char c)
{
	char hund = c/100;
	char tens = (c % 100)/10;
	char ones = (c % 100) % 10;
	LCD_RS = 1;	// write characters
	lcd_write(hund + 0x30);	
	lcd_write(tens + 0x30);
	lcd_write(ones + 0x30);	
}


// ****************************************************
// Initialize the LCD
// ****************************************************

 
void
lcd_init()
{
// --- For PortB LCD Control---
TRISB = 0;
// --- For PortC LCD Control---
//TRISC = 0;
// --- For PortD LCD Control---
//TRISD = 0;

LCD_RS = 0;
LCD_EN = 0;
LCD_RW = 0;

	char init_value = 0x3;
	
	pause (15);				// wait 15mSec after power applied,
	char temp = init_value;
	LCD_DATA = LCD_DATA & 0xF0;
	LCD_DATA = LCD_DATA + temp;
	LCD_STROBE();
	pause(10);
	LCD_STROBE();
	pause(10);
	LCD_STROBE();
	pause(10);
	char temp = 2;	// Four bit mode
	LCD_DATA = LCD_DATA & 0xF0;
	LCD_DATA = LCD_DATA + temp;
	LCD_STROBE();
	
	lcd_write(0x28); // Set interface length
//	lcd_write(0xC); // Display On, Cursor Off, Blink Off
	lcd_write(0xF); // Display On, Cursor On, Cursor Blink
	lcd_clear();	// Clear screen
	lcd_write(0x6); // Set entry Mode
}


// ****************************************************
// Initialize Hardware USART
// The serial commands all work with the hardware USART
// and is limted to 2400 baud or 9600 baud. Formula for 
// baud rate calculation is FOSC/[64(SPBRG + 1)].
// ****************************************************

void init_serial(int baud)
{	
RX_PIN = 1;	
TX_PIN = 0;
if (baud == 2400)		  
{SPBRG = 103;}		// 2400 Baud value
else
{SPBRG = 25;}		// 9600 Baud value
 	
//Continuous 8 bit asynchronous non inverted low speed communication
RCSTA = 0x90; // SPEN and CREN bit = 1, RX9EN = 0
TXSTA = 0x20;//TXEN = 1, BRGH = 0, SYNC = 0
BAUDCTL = 0; //BRG16 = 0 
}

// ****************************************************
// Send ASCII Character from Hardware USART
// ****************************************************

void 
putch(unsigned char byte) 
{
	/* output one byte */
	while(!TXIF)	/* set when register is empty */
		continue;
	TXREG = byte;
}


// ****************************************************
// Receive ASCII Character from Hardware USART
// ****************************************************

unsigned char 
getch()
{
	/* retrieve one byte */
	while(!RCIF)	/* set when register is not empty */
		continue;
	return RCREG;	
}

// ****************************************************
// Hardware SPI Setup
// ****************************************************

/* SPI Peripheral Setup */
void spi_init(void)
{
// *** 16F690 Settings ***
//TRISC7 = 0;	// SDO pin set to output
//TRISB6 = 0;	// SCK pin set to output (Master Mode)
//TRISC6 = 0;	// CS pin set to output
// *** 16F886 Settings ***
TRISC5 = 0;	// SDO pin set to output
TRISC3 = 0;	// SCK pin set to output (Master Mode)
TRISA5 = 0;	// CS pin set to output
/* SSPCON Settings  */
// *** FOSC = 4Mhz ***
//SSPCON = 0b00000001;	// SPI Clock Frequency set to FOSC/16 = 250khz
// *** FOSC = 16Mhz ***
SSPCON = 0b00000010;	// SPI Clock Frequency set to FOSC/64 = 250khz
CKP = 0; 				// Idle state of clock is low
	
/*  SSPSTAT Settings  */
SMP = 1;		// Sampled at end of data pulse
CKE = 1;		// Data Transfered on rising edge of clock

/* SPI Peripheral on  */
SSPEN = 1; 		// Enable SPI peripheral
pause(1);		// Allow SPI to Stabilize
}

// ****************************************************
// Hardware SPI Output
// ****************************************************

char SPI_OUTPUT ( char spi_byte )
{
	SSPBUF = spi_byte;
	do {
		}
	while(!BF);
	return SSPBUF;
}


// ****************************************************
// External SPI EEPROM Write
// ****************************************************


void WR_BYTE ( char EE_address, char EE_data )
{
	char dummy;
	CS = 0;			// Select EEPROM by pulling CS low
	dummy = SPI_OUTPUT ( 0x06 ); // Send write enable command
	CS = 1;			// Release EEPROM chip with CS high
	pause(5);
	CS = 0;			// Enable EEPROM again
	dummy = SPI_OUTPUT ( 0x02 ); // Send Write command
	dummy = SPI_OUTPUT ( EE_address );    // Send Address location
	dummy = SPI_OUTPUT ( EE_data );       // Send Data
	CS = 1; 		// Release EEPROM to allow byte to be written
	
}


// ****************************************************
// External SPI EEPROM Read
// ****************************************************


char RD_BYTE ( char EE_address )
{
	char dummy;
	char spi_received = 0;
	CS = 0;	// Set chip select low
	dummy = SPI_OUTPUT (0x03); // Send read command
	dummy = SPI_OUTPUT (EE_address ); // Send Address
	spi_received = SPI_OUTPUT ( 0x00 ); // Receive Stored Value
	CS = 1;		// Bring chip select high to terminate
				// the read command

	return spi_received;
}

