pablomdd/PIC16f887-EEPROM-I2C/eeprom_i2c.c
// ****************************************************
// External I/O Expander Write
// ****************************************************

void WR_MCP23S08 ( char regist, char data )
{
	char dummy;
	CS = 0;			// Select MCP23S08 by pulling CS low
	dummy = SPI_OUTPUT ( 0x40 ); 	// Send Device Opcode, select Write mode 
	dummy = SPI_OUTPUT ( regist );  // Send Register Address location
	dummy = SPI_OUTPUT ( data );    // Send Data byte
	CS = 1; 		// Release EEPROM to allow byte to be written
	
}
// ****************************************************
// External I/O Expander Read
// ****************************************************


char RD_MCP23S08 ( char regist )
{
	char dummy;
	CS = 0;			// Set chip select low
	dummy = SPI_OUTPUT (0x41); // Send Device Opcode, select Read mode
	dummy = SPI_OUTPUT (regist); // Send Address
	char data =  SPI_OUTPUT ( 0x00 ); // Receive data byte
	CS = 1;		// Bring chip select high to terminate
	return data;
}
// ****************************************************
//   PWM1 Output Function (Pin C2)
//  ***************************************************
void pwmout1 (char duty, int freq) 
{
	TRISC2 = 1;
	CCP1CON = 0;				//Turn CCP Module Off
	// *** Setup PWM ************
//	PR2 = 62500/freq;			// 4mhz
	PR2 = (250000/freq)-1;		// Set PWM Frequency
	CCPR1L = ((duty*(PR2+1))/100);	// Set Duty Cycle
	TMR2IE = 0;					// Disable Timer 2 Interrupt
	T2CKPS0 = 1;				// Set timer2 prescaler to 16
	T2CKPS1 = 1;
	CCP1CON = 0b00001100;		// Configure PWM Mode, Set DB bits to 10
	TMR2ON = 1;					// Turn on Timer 2
	 
	while (TMR2IF ==0)			// Wait for start of period
		{}
	
	TRISC2 = 0;
}

// ****************************************************
//   PWM2 Output Function (Pin C3)
//  ***************************************************
void pwmout2 (char duty, int freq) 
{
	TRISC1 = 1;
	CCP2CON = 0;				//Turn CCP Module Off
	// *** Setup PWM ************
	PR2 = (250000/freq)-1;		// Set PWM Freq.
	CCPR2L = ((duty*(PR2+1))/100);	// Set Duty Cycle
	TMR2IE = 0;					// Disable Timer 2 Interrupt
	T2CKPS0 = 1;				// Set timer2 prescaler to 16
	T2CKPS1 = 1;
	CCP2CON = 0b00001100;		// Configure PWM Mode, Set DB bits to 10
	TMR2ON = 1;					// Turn on Timer 2
	 
	while (TMR2IF ==0)			// Wait for start of period
		{}
	
	TRISC1 = 0;
}
// ****************************************************
//  A/D Setup 
//  chan - 0 thru 4 representing AN0 thru AN4
// ****************************************************	
char adcin (char chan)
{
switch(chan)
	{
	case 0:
	TRISA0 = 1;				// Make RA0/AN0 an Input
	ANS0 = 1;				// Configure RA0 to Analog to Digital input
	ADCON0 = 0b11000000;	// Configure A/D to use AN0, left justified
	break;
	
	case 1:
	TRISA1 = 1;				// Make RA1/AN1 an Input
	ANS1 = 1;				// Configure RA1 to Analog to Digital input
	ADCON0 = 0b11000100;	// Configure A/D to use AN1, left justified
	break;

	case 2:
	TRISA2 = 1;				// Make RA2/AN2 an Input
	ANS2 = 1;				// Configure RA2 to Analog to Digital input
	ADCON0 = 0b11001000;	// Configure A/D to use AN2, left justified
	break;

	case 3:
	TRISA3 = 1;				// Make RA3/AN3 an Input
	ANS3 = 1;				// Configure RA3 to Analog to Digital input
	ADCON0 = 0b11001100;	// Configure A/D to use AN3, left justified
	break;

	case 4:
	TRISA5 = 1;				// Make RA5/AN4 an Input
	ANS4 = 1;				// Configure RA5 to Analog to Digital input
	ADCON0 = 0b11010000;	// Configure A/D to use AN4, left justified
	break;

	default:
	break;
	}
	
	ADON = 1; 				// A/D Converter on;
	pause (1);				// Sample Time
	GO_DONE = 1;				// Start A/D conversion on AN0
	while(GO_DONE == 1); 	// Wait for conversion to complete
	char value = ADRESH;
	return value;
	
}
/******************************************************************************************/
// Hardware I2C single master routines for PIC16F886
// for HI-TECH PIC C COMPILER.
//
// i2c_init  - initialize I2C functions
// i2c_start - issue Start condition
// i2c_repStart- issue Repeated Start condition
// i2c_stop  - issue Stop condition
// i2c_read(x) - receive unsigned char - x=0, don't acknowledge - x=1, acknowledge
// i2c_write - write unsigned char - returns ACK
//
//
//******************************************************************************************

void i2c_init()
{
 TRISC3=1;           // set SCL and SDA pins as inputs
 TRISC4=1;

 SSPCON = 0x38;      // set I2C master mode
 SSPCON2 = 0x00;

// Formula for SSPADD register value: SSPADD = [(Fosc/4)/BitRate] - 1
 SSPADD = 0x27;     // 100k at 16Mhz clock
					// [(16Mhz/4)/100khz]-1 = 39 or 0x27 hex

 CKE=1;     // use I2C levels      worked also with '0'
 SMP=1;     // disable slew rate control  worked also with '0'

 SSPIF=0;      // clear SSPIF interrupt flag
 BCLIF=0;      // clear bus collision flag
}

//******************************************************************************************

void i2c_waitForIdle()
{
 while (( SSPCON2 & 0x1F ) | R_W ) {}; // wait for idle and not writing
}

//******************************************************************************************

void i2c_start()
{
 i2c_waitForIdle();
 SEN=1;
}

//******************************************************************************************

void i2c_repStart()
{
 i2c_waitForIdle();
 RSEN=1;
}

//******************************************************************************************

void i2c_stop()
{
 i2c_waitForIdle();
 PEN=1;
}

//******************************************************************************************

int i2c_read( unsigned char ack )
{
 unsigned char i2cReadData;

 i2c_waitForIdle();

 RCEN=1;

 i2c_waitForIdle();

 i2cReadData = SSPBUF;

 i2c_waitForIdle();

 if ( ack )
  {
  ACKDT=0;
  }
 else
  {
  ACKDT=1;
  }
  ACKEN=1;               // send acknowledge sequence

 return( i2cReadData );
}

//******************************************************************************************

unsigned char i2c_write( unsigned char i2cWriteData )
{
 i2c_waitForIdle();
 SSPBUF = i2cWriteData;

 return ( ! ACKSTAT  ); // function returns '1' if transmission is acknowledged
}

// *********************************************************************************
// i2c_eeout function to write to an 8-bit address Microchip EEPROM part (i.e. 24LC256)
// *********************************************************************************


