pablomdd/PIC16f887-EEPROM-I2C/eeprom_i2c.c
void I2C_EEOUT(unsigned char address, unsigned char data)
 {
   i2c_start();
   i2c_write(0xa0);
   i2c_write(address);
   i2c_write(data);
   i2c_stop();
   pause(11);
}


// *********************************************************************************
// i2c_eein function to read from an 8-bit address Microchip EEPROM part (i.e. 24LC256)
// *********************************************************************************

unsigned char I2C_EEIN(unsigned char address)
{
   unsigned char data;

   i2c_start();
   i2c_write(0xa0);
   i2c_write(address);
   i2c_repStart();
   i2c_write(0xa1);
   data=i2c_read(0);
   i2c_stop();
   return(data);
}

/********************************************************   MAIN   ************************************************************/

void
main(void)
{

init_micro();	// Initialize I/O
i2c_init();    	// Initialize i2c 
ANSEL=0x00; 
ANSELH=0x00; 
PORTB=0x00;    	// All LEDs off
TRISB=0x00;    	// All PORTB outputs
TRISA=0x00;
TRISD=0x00;
/*
//ADC CONFIG    
	TRISE=0x03;
	ADCON1=0b00000000;
	PR2=0xFF;

	CCP1CON = 0xC0;
	CCP2CON = 0xC0;
	T2CKPS1 = 1;
	T2CKPS0 = 1;
	TMR2ON = 1;
*/
//LCD VARS
	LCD_RS=0;
	LCD_EN=0;
	LCD_RW=0;

	pause(15);
	LCD_DATA=init_value;
	LCD_STROBE();
	pause(10);
	LCD_STROBE();
	pause(10);
	LCD_STROBE();
	pause(10);
	LCD_DATA=2;
	LCD_STROBE();

	lcd_write(0x28);
	lcd_write(0xC);
	lcd_clear();
	lcd_write(0x06);
//Serial port config
    RX_PIN=1; 
    TX_PIN=0; 
    OSCCON=0x70; 
    SPBRG=12; //9600 BAUDIOS.Cambiar para otra cantidad. 
    RCSTA=0x90; //Recepción disponible (SREN=1), 8 Bits, SPEN=1 (Puerto serial habilitados). 
    TXSTA=0x20; //Baja velocidad, SYNC=0 modo asíncrono, TXEN=1, 8 bits.
    BAUDCTL=0x00; //Detector de Baudios deshabilitado, 8 bits, sin inversión, 
    pause(500); 

//OTHER VARS
	char char_recibido;
	char char_pwm;
	char buffer[15];
   

	 PORTA=0x01;
    *pa=0xFF;
	
	putch(0x0D); 
    putch(0x0A); 
	//abecedario
    for(int i=97; i<123; i++){
        putch(i); 
        pause(20); 
    }
    putch(0x0D); 
    putch(0x0A); 



unsigned char cnt=0;
 
 while(cnt<=255)   /* write 10 numbers to eeprom */
  {        
  PORTB=cnt;         		// The cnt value will display on the LEDs
  I2C_EEOUT(cnt,10-cnt);   	// Store 9 at address 1, 8 at address 2, ...
  cnt=cnt+1;				// Increment cnt variable
  pause(255);				// Delay 255 milliseconds
  }

 cnt=0;

 while(cnt<=255)
  {
	 PORTB =I2C_EEIN(cnt); 	// Display data read from EEPROM on LEDs in binary 
	 pause (100);			// Delay for 1 second to read LEDs

	sprintf(buffer,"Valor es:%i  ", cnt);
	//	Muestra en Terminal el valor le?do desde el PIC
	for (char x = 0; x<17; x++)
		{
			putch (buffer[x]);
		}
	pause(200);
	//	Retorno de Carro, Salto de l?nea en hex ASCII		
	putch(0x0D); 
	putch(0x0A); 

	 cnt=cnt + 1;			// Increment cnt variable
  }
}